// See https://aka.ms/new-console-template for more information
//0. Демонстрация решения
// Напишите программу, которая на вход принимает число
// и выдаёт его квадрат (число умноженное на само себя).

int number = int.Parse(Console.ReadLine());

int quarter = number * number;

Console.WriteLine(quarter);